In [4]:
import pandas as pd

In [5]:
satu = pd.DataFrame({
    'a': ['a0', 'a1', 'a2', 'a3', 'a4', 'a5'],
    'b': ['b0', 'b1', 'b2', 'b3', 'b4', 'b5'],
    'c': ['c0', 'c1', 'c2', 'c3', 'c4', 'c5'],
    'd': ['d0', 'd1', 'd2', 'd3', 'd4', 'd5']
},
    index=[list(range(0, 6))])

In [24]:
dua = pd.DataFrame({
    'a': ['a6', 'a7', 'a8', 'a9', 'a10', 'a11'],
    'b': ['b6', 'b7', 'b8', 'b9', 'b10', 'b11'],
    'c': ['c6', 'c7', 'c8', 'c9', 'c10', 'c11'],
    'd': ['d6', 'd7', 'd8', 'd9', 'd10', 'd11']
},
    index=[list(range(6, 12))])

In [29]:
tiga = pd.DataFrame({
    'a': ['a12', 'a13', 'a14', 'a15', 'a16', 'a17'],
    'b': ['b12', 'b13', 'b14', 'b15', 'b16', 'b17'],
    'c': ['c12', 'c13', 'c14', 'c15', 'c16', 'c17'],
    'd': ['d12', 'd13', 'd14', 'd15', 'd16', 'd17']
},
    index=[list(range(12, 18))])

In [26]:
satu

    a   b   c   d
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [27]:
dua

      a    b    c    d
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [30]:
tiga

      a    b    c    d
12  a12  b12  c12  d12
13  a13  b13  c13  d13
14  a14  b14  c14  d14
15  a15  b15  c15  d15
16  a16  b16  c16  d16
17  a17  b17  c17  d17

In [31]:
# Concatenation

In [33]:
pd.concat([satu, dua, tiga])

      a    b    c    d
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11
12  a12  b12  c12  d12
13  a13  b13  c13  d13
14  a14  b14  c14  d14
15  a15  b15  c15  d15
16  a16  b16  c16  d16
17  a17  b17  c17  d17

In [39]:
pd.concat([satu, dua, tiga], axis=1)  # berantakan harusnya axis=0

      a    b    c    d    a    b    c    d    a    b    c    d
0    a0   b0   c0   d0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    a1   b1   c1   d1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    a2   b2   c2   d2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    a3   b3   c3   d3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4    a4   b4   c4   d4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5    a5   b5   c5   d5  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   a6   b6   c6   d6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   a7   b7   c7   d7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   a8   b8   c8   d8  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN   a9   b9   c9   d9  NaN  NaN  NaN  NaN
10  NaN  NaN  NaN  NaN  a10  b10  c10  d10  NaN  NaN  NaN  NaN
11  NaN  NaN  NaN  NaN  a11  b11  c11  d11  NaN  NaN  NaN  NaN
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a12  b12  c12  d12
13  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a13  b13  c13  d13
14  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a14  b14  c14  d14
15  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a15  b15  c15  d15
16  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a16  b16  c16  d16
17  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a17  b17  c17  d17

In [5]:
bisbis = pd.DataFrame({
    'Perusahaan':
        ['Telkom', 'Pertamina', 'BRI', 'Pertamina', 'KFC', 'KFC', 'Telkom', 'Indosat'],
    'Karyawan':
        ['Joko', 'Budi', 'Susi', 'Iriana', 'Buharnudin', 'Bambang', 'Intan', 'Mukiman'],
    'Usia':
        [32, 43, 65, 76, 87, 54, 34, 18]
})

In [6]:
bisbis

  Perusahaan    Karyawan  Usia
0     Telkom        Joko    32
1  Pertamina        Budi    43
2        BRI        Susi    65
3  Pertamina      Iriana    76
4        KFC  Buharnudin    87
5        KFC     Bambang    54
6     Telkom       Intan    34
7    Indosat     Mukiman    18

In [11]:
bisbis.groupby('Perusahaan')

In [19]:
bisbis.groupby('Perusahaan').sum()

                     Karyawan  Usia
Perusahaan
BRI                      Susi    65
Indosat               Mukiman    18
KFC         BuharnudinBambang   141
Pertamina          BudiIriana   119
Telkom              JokoIntan    66

In [14]:
bisbis.groupby('Perusahaan').count()

            Karyawan  Usia
Perusahaan
BRI                1     1
Indosat            1     1
KFC                2     2
Pertamina          2     2
Telkom             2     2

In [15]:
bisbis.groupby('Perusahaan').mean('Perusahaan')

            Usia
Perusahaan
BRI         65.0
Indosat     18.0
KFC         70.5
Pertamina   59.5
Telkom      33.0

In [68]:
bisbis.groupby('Perusahaan').min()

           Karyawan  Usia
Perusahaan
BRI            Susi    65
Indosat     Mukiman    18
KFC         Bambang    54
Pertamina      Budi    43
Telkom        Intan    32

In [16]:
bisbis.groupby('Perusahaan').Usia.min()

Perusahaan
BRI          65
Indosat      18
KFC          54
Pertamina    43
Telkom       32
Name: Usia, dtype: int64

In [17]:
bisbis.groupby('Perusahaan').min('Usia')

            Usia
Perusahaan
BRI           65
Indosat       18
KFC           54
Pertamina     43
Telkom        32

In [9]:
bisbis.groupby('Perusahaan')

In [18]:
bisbis.groupby('Perusahaan').describe()

            Usia
           count  mean        std   min    25%   50%    75%   max
Perusahaan
BRI          1.0  65.0        NaN  65.0  65.00  65.0  65.00  65.0
Indosat      1.0  18.0        NaN  18.0  18.00  18.0  18.00  18.0
KFC          2.0  70.5  23.334524  54.0  62.25  70.5  78.75  87.0
Pertamina    2.0  59.5  23.334524  43.0  51.25  59.5  67.75  76.0
Telkom       2.0  33.0   1.414214  32.0  32.50  33.0  33.50  34.0

In [72]:
bisbis.groupby('Perusahaan').describe().transpose()

Perusahaan   BRI  Indosat        KFC  Pertamina     Telkom
Usia count   1.0      1.0   2.000000   2.000000   2.000000
     mean   65.0     18.0  70.500000  59.500000  33.000000
     std     NaN      NaN  23.334524  23.334524   1.414214
     min    65.0     18.0  54.000000  43.000000  32.000000
     25%    65.0     18.0  62.250000  51.250000  32.500000
     50%    65.0     18.0  70.500000  59.500000  33.000000
     75%    65.0     18.0  78.750000  67.750000  33.500000
     max    65.0     18.0  87.000000  76.000000  34.000000

In [73]:
# Sql

In [79]:
satu = pd.DataFrame({
    'Key': ['k0', 'k1', 'k2', 'k3', 'k4', ],
    'one': list(range(1, 6)),
    'two': list(range(6, 11))
})

In [100]:
dua = pd.DataFrame({
    'Key': ['k0', 'k1', 'k2', 'k3', 'k4', ],
    'three': list(range(1, 6)),
    'four': list(range(6, 11))
})

In [101]:
satu

  Key  one  two
0  k0    1    6
1  k1    2    7
2  k2    3    8
3  k3    4    9
4  k4    5   10

In [102]:
dua

  Key  three  four
0  k0      1     6
1  k1      2     7
2  k2      3     8
3  k3      4     9
4  k4      5    10

In [103]:
# Merge / join

In [104]:
baru = pd.merge(satu, dua, how='inner', on='Key')

In [105]:
baru

  Key  one  two  three  four
0  k0    1    6      1     6
1  k1    2    7      2     7
2  k2    3    8      3     8
3  k3    4    9      4     9
4  k4    5   10      5    10

In [106]:
satu = pd.DataFrame({
    'Key1': ['k0', 'k0', 'k1', 'k2'],
    'Key2': ['k0', 'k1', 'k0', 'k1'],
    'A': ['A0', 'A1', 'A2', 'A3', ],
    'B': ['B0', 'B1', 'B2', 'B3', ]
})
dua = pd.DataFrame({
    'Key1': ['k0', 'k1', 'k1', 'k2'],
    'Key2': ['k0', 'k0', 'k0', 'k0'],
    'C': ['C0', 'C1', 'C2', 'C3', ],
    'D': ['D0', 'D1', 'D2', 'D3', ]
})

In [115]:
left = pd.merge(satu, dua, how='left', on=['Key1', 'Key2'])

In [116]:
left

  Key1 Key2   A   B    C    D
0   k0   k0  A0  B0   C0   D0
1   k0   k1  A1  B1  NaN  NaN
2   k1   k0  A2  B2   C1   D1
3   k1   k0  A2  B2   C2   D2
4   k2   k1  A3  B3  NaN  NaN

In [117]:
right = pd.merge(satu, dua, how='right', on=['Key1', 'Key2'])

In [118]:
right

  Key1 Key2    A    B   C   D
0   k0   k0   A0   B0  C0  D0
1   k1   k0   A2   B2  C1  D1
2   k1   k0   A2   B2  C2  D2
3   k2   k0  NaN  NaN  C3  D3

In [119]:
outer = pd.merge(satu, dua, how='outer', on=['Key1', 'Key2'])

In [120]:
outer

  Key1 Key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k0  NaN  NaN   C3   D3
5   k2   k1   A3   B3  NaN  NaN

In [122]:
bapak = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']},
    index=['K0', 'K1', 'K2'])
ibu = pd.DataFrame({
    'C': ['C0', 'C2', 'C3', ],
    'D': ['D0', 'D2', 'D3', ]},
    index=['K0', 'K2', 'K3', ])

In [123]:
bapak

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [124]:
ibu

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
# Join

In [125]:
join=bapak.join(ibu, )

In [126]:
join

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [129]:
joinInner=bapak.join(ibu,how='inner')

In [130]:
joinInner

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2